In [1]:
#Bibliotecas

import pandas as pd
import numpy as np

In [2]:
# ler um dataframe

df_produtos = pd.read_csv('C:/Users/Samsung/Datasets/Kaggle/Product_range.csv')

In [3]:
df_produtos.head()

,Product_code,Vendor_code,Name,Retail_price,Base_unit,Country_of_Origin,Size,ABV
0,5028,NaN,1 Symbiotica Apple 0.375,300.0,Pieces,Russia,0.375,4.5
1,4846,NaN,1 Symbiotica Hard Kombucha Renegade Aronia 0.33,200.0,Pieces,Russia,0.330,3.0
2,1340,NaN,1000 IBU Imperial IPA Barrel l,960.0,Liters,NaN,1.000,9.6
3,4372,NaN,18th Street Brewery,NaN,NaN,USA,NaN,NaN
4,4302,NaN,18th Street Brewery Deal With The Devil 0.473,630.0,Pieces,USA,0.473,8.5

In [ ]:
df_produtos.tail()

In [4]:
#Contagem da quantidade de valores não nulo/ausentes nas colunas

df_produtos.count()

Product_code         5314
Vendor_code          4288
Name                 5314
Retail_price         4878
Base_unit            4910
Country_of_Origin    4205
Size                 4626
ABV                  4622
dtype: int64

In [11]:
# Informação do tipo econtagem dos valores não nulos das colunas

df_produtos.dtypes

Product_code           int64
Vendor_code           object
Name                  object
Retail_price         float64
Base_unit             object
Country_of_Origin     object
Size                 float64
ABV                  float64
dtype: object

In [12]:
#Resumo descritivo estatístico de cada coluna

df_produtos.describe()

       Product_code  Retail_price         Size          ABV
count   5314.000000   4878.000000  4626.000000  4622.000000
mean    2690.844750    637.839502     0.626917     7.074273
std     1543.217814    504.895006     0.953290     2.457970
min        2.000000      1.000000     0.150000     0.500000
25%     1357.250000    350.000000     0.330000     5.300000
50%     2690.500000    520.000000     0.500000     6.500000
75%     4027.750000    730.000000     1.000000     8.200000
max     5358.000000   8484.850000    30.000000    21.000000

In [13]:
#Leitura da planilha de vendas

df_sales = pd.read_csv('C:/Users/Samsung/Datasets/Kaggle/Transactions.csv')
df_sales.head()

,Date_and_time_of_unloading,Product_code,Amount,Sale_amount,Discount_amount,Profit,Percentage_markup,Discount_percentage
0,2020-01-01 23:00:00,144,1.0,280.00,NaN,155.00,124.00,NaN
1,2020-01-01 23:00:00,209,2.0,545.73,294.27,75.73,16.11,35.03
2,2020-01-01 23:00:00,213,2.0,1265.05,34.95,653.05,106.71,2.69
3,2020-01-01 23:00:00,217,1.0,630.00,70.00,220.50,53.85,10.00
4,2020-01-01 23:00:00,222,2.0,1104.75,195.25,393.75,55.38,15.02

In [14]:
#Somente a informação do tipo das colunas

df_sales.dtypes

Date_and_time_of_unloading     object
Product_code                    int64
Amount                        float64
Sale_amount                   float64
Discount_amount               float64
Profit                        float64
Percentage_markup             float64
Discount_percentage           float64
dtype: object

In [23]:
# Juntando dois dataframes

df = df_sales.merge(df_produtos, on = ['Product_code'], how = 'left')
df.head(5)

,Date_and_time_of_unloading,Product_code,Amount,Sale_amount,Discount_amount,Profit,Percentage_markup,Discount_percentage,Vendor_code,Name,Retail_price,Base_unit,Country_of_Origin,Size,ABV
0,2020-01-01 23:00:00,144,1.0,280.00,NaN,155.00,124.00,NaN,AF Brew,AF Brew Zimnjaja Melanholija Coffee + Vanilla ...,280.0,Pieces,Russia,0.33,10.3
1,2020-01-01 23:00:00,209,2.0,545.73,294.27,75.73,16.11,35.03,Pohjala,"Pohjala Mutant Disco / IPA / 6.8% / 0,/ but",420.0,Pieces,Estonia,0.33,6.8
2,2020-01-01 23:00:00,213,2.0,1265.05,34.95,653.05,106.71,2.69,Kerisac,Cider Kerisac Cidre Breton Brut Traditionnel /...,650.0,Pieces,France,1.00,6.0
3,2020-01-01 23:00:00,217,1.0,630.00,70.00,220.50,53.85,10.00,Savoie,Cider Savoie Cidre of Apples and Pears Brut / ...,870.0,Pieces,France,0.75,4.5
4,2020-01-01 23:00:00,222,2.0,1104.75,195.25,393.75,55.38,15.02,Bellot,Cider Bellot Cidre de Cru du Pays d’Othe Brut ...,770.0,Pieces,France,0.75,5.0

In [25]:
# Realizando uma junção das planilhas vendas e produtos, levando informações da planilha produtos para a planilha vendas 

#df1 = df_sales.merge(df_produtos, how='left', left_on=['Product_code'], right_on=['Product_code'])

In [26]:
#df1.head(5)

In [ ]:
df.info()

In [27]:
#Verificando valores ausentes: Soma dos valores nulos encotrados

df.isnull().sum()

Date_and_time_of_unloading        0
Product_code                      0
Amount                            0
Sale_amount                      51
Discount_amount               10202
Profit                           14
Percentage_markup              1939
Discount_percentage           10202
Vendor_code                    6324
Name                              0
Retail_price                      3
Base_unit                         0
Country_of_Origin              8509
Size                           5836
ABV                            5850
dtype: int64

In [28]:
#Porcentagem de valores ausentes 

#Porcentagem_ausentes1 = (df.isnull().sum()/ len(df['Product_code']))*100
Porcentagem_ausentes = (df.isnull().sum()/ df['Product_code'].count())*100
Porcentagem_ausentes

Date_and_time_of_unloading     0.000000
Product_code                   0.000000
Amount                         0.000000
Sale_amount                    0.101829
Discount_amount               20.369779
Profit                         0.027953
Percentage_markup              3.871496
Discount_percentage           20.369779
Vendor_code                   12.626787
Name                           0.000000
Retail_price                   0.005990
Base_unit                      0.000000
Country_of_Origin             16.989458
Size                          11.652424
ABV                           11.680377
dtype: float64

In [ ]:
# Função utilizada para preencher os valores ausentes: fillna

df["Vendor_code"] = df["Vendor_code"].fillna(0)
df["Discount_amount"] = df["Discount_amount"].fillna(0)
df["Country_of_Origin"] = df["Country_of_Origin"].fillna('Nenhuma')

In [ ]:
df.isnull().sum()

In [ ]:
df["Sale_amount"] = df["Sale_amount"].fillna(df["Sale_amount"].mean())

In [ ]:
df.isnull().sum()

In [ ]:
df['Discount_percentage']  = df['Discount_percentage'].fillna(0)

In [ ]:
df.isnull().sum()

In [ ]:
#Função para criar a coluna de categorias

def alco_categoric(abv):
    if abv > 2.0:
        return 'Alco'
    if abv <= 2.0:
        return 'Low_Alco'
    else:
        return 'No_alco'
    
df['Alco_Type'] = df['ABV'].apply(alco_categoric)

In [ ]:
#Frequencia das categorias value_counts

df['Alco_Type'].value_counts()

In [ ]:
df.tail()

In [ ]:
#Adicionando duas colunas no dataframe df

df['Retail_price'] = (df['Sale_amount'] + df['Discount_amount']) / df['Amount']
df['Retail_sum'] = df['Sale_amount'] + df['Discount_amount']

In [ ]:
df.head()

In [ ]:
#Função replace: usada para substituir strings
df['Country_of_Origin'].replace('Russia', 'Guerra', inplace=True)

In [ ]:
df['Country_of_Origin']

In [5]:
# import module
import pandas as pd
import numpy as np
  
# assign data
dataFrame = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                            
                          'Age': [30, 35, 37, 33, 34, 30],
                            
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                            
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})
  
# display dataframe
display(dataFrame)

         Name  Age  Salary          JOB
0    RACHEL     30  100000     DESIGNER
1    MONICA     35   93000         CHEF
2    PHOEBE     37   88000        MASUS
3    ROSS       33  120000  PALENTOLOGY
4    CHANDLER   34   94000           IT
5    JOEY       30   95000       ARTIST

In [6]:
# filter dataframe usando loc

df = dataFrame.loc[(dataFrame['Salary']>=100000) & (dataFrame['Age']< 40) & (dataFrame['JOB'].str.startswith('D')),
                    ['Name','JOB']]

In [7]:
df.head()

        Name       JOB
0   RACHEL    DESIGNER

In [8]:
# filter dataframe                                   
filtered_values = np.where((dataFrame['Salary']>=100000) & (dataFrame['Age']< 40) & (dataFrame['JOB'].str.startswith('D')))
print(filtered_values)
display(dataFrame.loc[filtered_values])

(array([0], dtype=int64),)

        Name  Age  Salary       JOB
0   RACHEL     30  100000  DESIGNER

In [13]:
import pandas as pd

# Criando um dataframe de exemplo
data = {'Nome': ['João', 'Maria', 'Pedro', 'Ana'],
        'Idade': [25, 30, 35, 40],
        'Cidade': ['São Paulo', 'Rio de Janeiro', 'São Paulo', 'Rio de Janeiro']}
df = pd.DataFrame(data)

# Filtrando colunas baseado em uma condição na coluna "Cidade"
colunas_filtradas = df.loc[df['Cidade'] == 'São Paulo', ['Nome', 'Cidade']]

# Exibindo o resultado
print(colunas_filtradas)

    Nome     Cidade
0   João  São Paulo
2  Pedro  São Paulo

In [14]:
import pandas as pd

# Criando um dataframe de exemplo
data = {'Nome': ['João', 'Maria', 'Pedro', 'Ana'],
        'Idade': [25, 30, 35, 40],
        'Cidade': ['São Paulo', 'Rio de Janeiro', 'São Paulo', 'Rio de Janeiro']}
df = pd.DataFrame(data)

# Filtrando colunas baseado em condições nas colunas "Nome" e "Cidade"
colunas_filtradas = df.loc[(df['Nome'].isin(['João', 'Pedro'])) & (df['Cidade'] == 'São Paulo'), :]

# Exibindo o resultado
print(colunas_filtradas)

    Nome  Idade     Cidade
0   João     25  São Paulo
2  Pedro     35  São Paulo

In [15]:
import pandas as pd

# Criando um dataframe de exemplo
data = {'Nome': ['João', 'Maria', 'Pedro', 'Ana'],
        'Idade': [25, 30, 35, 40],
        'Cidade': ['São Paulo', 'Rio de Janeiro', 'São Paulo', 'Rio de Janeiro']}
df = pd.DataFrame(data)

# Filtrando colunas baseado em uma condição na coluna "Cidade"
colunas_filtradas = df.loc[df['Cidade'] == 'São Paulo', ['Nome', 'Cidade']]

# Exibindo o resultado
print(colunas_filtradas)

    Nome     Cidade
0   João  São Paulo
2  Pedro  São Paulo

In [3]:
import pandas as pd

# Criando um DataFrame de exemplo
data = {'CPF': ['12345678900', '98765432100', '24681357900']}
df = pd.DataFrame(data)

# Substituindo os números do meio por "xxx"
df['CPF'] = df['CPF'].replace(r'\d{3}(?=\d{3})', 'xxx', regex=True)

# Exibindo o DataFrame resultante
print(df)

           CPF
0  xxxxxx78900
1  xxxxxx32100
2  xxxxxx57900